1.根据上方表格数据创建一个 DataFrame 存储公司的数据，数据命名为 df_company

In [1]:
import pandas as pd

In [2]:
df_company=pd.DataFrame({'股票代码':['600926','002958','601128','601398','601229','600919'],
                         '市值（亿）':[449,371,237,21313,1369,823],
                         '市值率':[8.31,15.36,16.01,7.16,7.59,6.3]},
                        index=['杭州银行','青农银行','常熟银行','工商银行','上海银行','江苏银行'])
df_company

        股票代码  市值（亿）    市值率
杭州银行  600926    449   8.31
青农银行  002958    371  15.36
常熟银行  601128    237  16.01
工商银行  601398  21313   7.16
上海银行  601229   1369   7.59
江苏银行  600919    823   6.30

2.选出市值低于 2000 亿的所有公司

In [3]:
df_company[df_company['市值（亿）']<2000]

        股票代码  市值（亿）    市值率
杭州银行  600926    449   8.31
青农银行  002958    371  15.36
常熟银行  601128    237  16.01
上海银行  601229   1369   7.59
江苏银行  600919    823   6.30

3.选出市值 < 2000亿，并且市盈率 < 10 的所有公司

In [4]:
df_company[(df_company['市值（亿）']<2000) & (df_company['市值率']<10)]

        股票代码  市值（亿）   市值率
杭州银行  600926    449  8.31
上海银行  601229   1369  7.59
江苏银行  600919    823  6.30

4.请计算收盘价的五日平均，并新增一列存储

In [5]:
import numpy as np

dr = pd.date_range(start='2019-01-02', periods=100)

data = np.random.randn(100).cumsum()

close = data - np.min(data)

df = pd.DataFrame({"close": close}, index=dr)

df

               close
2019-01-02  7.006880
2019-01-03  6.512175
2019-01-04  6.523163
2019-01-05  7.051699
2019-01-06  7.771250
...              ...
2019-04-07  7.836718
2019-04-08  6.912016
2019-04-09  4.791740
2019-04-10  4.582832
2019-04-11  5.560087

[100 rows x 1 columns]

In [6]:
df['roll_mean']=df['close'].rolling(5).mean()
df

               close  roll_mean
2019-01-02  7.006880        NaN
2019-01-03  6.512175        NaN
2019-01-04  6.523163        NaN
2019-01-05  7.051699        NaN
2019-01-06  7.771250   6.973033
...              ...        ...
2019-04-07  7.836718   7.846525
2019-04-08  6.912016   7.600010
2019-04-09  4.791740   7.050135
2019-04-10  4.582832   6.564532
2019-04-11  5.560087   5.936678

[100 rows x 2 columns]

5.创建 DataFrame 存储数据

In [7]:
df5=pd.DataFrame({'第1列':[1,5,9,13],
                  '第2列':[2,6,10,14],
                  '第3列':[3,7,11,15],
                  '第4列':[4,8,12,16]},
                index=list('abcd'))
df5

   第1列  第2列  第3列  第4列
a    1    2    3    4
b    5    6    7    8
c    9   10   11   12
d   13   14   15   16

6.请利用 apply 函数，统计出每一行的总数

In [8]:
df5.apply(lambda x:x.sum())

第1列    28
第2列    32
第3列    36
第4列    40
dtype: int64

7.请生成第 5 列数据，使其满足：当第 3 列数据 > 10 时，第 5 列数据等于第 1 、第 2 列数据之和；否则第 5 列数据等于第 3 列数据

In [9]:
df5['第5列']=df5.apply(lambda x:int(x[0]+x[1]) if x[2]>10 else int(x[2]),axis=1)
df5

   第1列  第2列  第3列  第4列  第5列
a    1    2    3    4    3
b    5    6    7    8    7
c    9   10   11   12   19
d   13   14   15   16   27